#!/bin/bash

echo "[*] Запуск честного сканирования уязвимостей кластера изнутри..."
sleep 1

ATTACK_SUCCESS=0


if 2>/dev/null cat /sys/kernel/debug/clear_warn_once >/dev/null; then
    echo "[!] КРИТИЧЕСКАЯ УЯЗВИМОСТЬ: Контейнер РЕАЛЬНО имеет статус Privileged!"
    ATTACK_SUCCESS=1
else
    echo "[+] Проверка на Privileged: Успешно изолировано (Доступа к ядру хоста нет)."
fi


if [ -d "/host/etc" ] && [ -d "/host/root" ]; then
    echo "[!] КРИТИЧЕСКАЯ УЯЗВИМОСТЬ: Обнаружен сквозной доступ к корню хоста через hostPath!"
    ATTACK_SUCCESS=1
fi


if [ $ATTACK_SUCCESS -eq 1 ]; then
    echo "======================================================="
    echo "  [ВВЕДЕН В ЭКСПЛУАТАЦИЮ] КЛАСТЕР СКОМПРОМЕТИРОВАН!    "
    echo "======================================================="
else
    echo "======================================================="
    echo "  [ЗАЩИЩЕНО] Атака не удалась. Контейнер изолирован.   "
    echo "======================================================="
fi


tail -f /dev/null
